Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase Properties
The ReinforcementBase type exposes the following members.
Properties
Name | Description
Attributes
 The common attributes of all reinforcements. For more information see ReinforcementBase.ReinforcementBaseAttributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from ModelObject.)
ModelIdentifier
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
 (Inherited from ModelObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
ReinforcementBase Class
Tekla.Structures.Drawing Namespace